package com.project.thor.snake.classes;

/**
 *@file Coordinate.java
 *@authot Bohomaz A.
 *@version 1
 *@date 2018.11.23
 */

public class Coordinate {
    private int x;
    private int y;

    // -----------------------------------------------------------------------------
    //  public Coordinate(int x, int y)
    //  конструктор класа
    // -----------------------------------------------------------------------------
    //
    public Coordinate(int x, int y) {
        this.x = x;
        this.y = y;
    }

    // -----------------------------------------------------------------------------
    //  public int getX()
    //  Геттер координаты х
    // -----------------------------------------------------------------------------
    //
    public int getX() {
        return x;
    }

    // -----------------------------------------------------------------------------
    //  public void setX(int x)
    //  Сеттер координаты х
    // -----------------------------------------------------------------------------
    //
    public void setX(int x) {
        this.x = x;
    }

    // -----------------------------------------------------------------------------
    //  public int getY()
    //  геттер координаты у
    // -----------------------------------------------------------------------------
    //
    public int getY() {
        return y;
    }

    // -----------------------------------------------------------------------------
    //  public void setY(int y)
    //  Сеттер координаты у
    // -----------------------------------------------------------------------------
    //
    public void setY(int y) {
        this.y = y;
    }

    // -----------------------------------------------------------------------------
    //  public boolean equals(Object o)
    //  переопределеный метод еквивалентности
    // -----------------------------------------------------------------------------
    //
    @Override
    public boolean equals(Object o) {
        if (this == o) return true;
        if (o == null || getClass() != o.getClass()) return false;
        Coordinate that = (Coordinate) o;
        if (getX() != that.getX()) return false;
        return getY() == that.getY();
    }

}
